<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Linear macOS Apple Silicon installer package.</string>

	<key>Identifier</key>
	<string>com.github.swifteaminc.recipes.download.linear</string>

	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Linear</string>

		<key>DOWNLOAD_PAGE_URL</key>
		<string>https://linear.app/download</string>

		<key>RE_PATTERN</key>
		<string>(?P&lt;url&gt;https://desktop\.linear\.app/mac/pkg/arm64)</string>

		<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
		<false/>
	</dict>

	<key>MinimumVersion</key>
	<string>0.4.0</string>

	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_PAGE_URL%</string>
				<key>re_pattern</key>
				<string>%RE_PATTERN%</string>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
				<key>filename</key>
				<string>%NAME%-arm64.pkg</string>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
