<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Android Studio for macOS Apple Silicon and reads its version.</string>

	<key>Identifier</key>
	<string>com.github.swifteaminc.recipes.download.androidstudio</string>

	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AndroidStudio</string>

		<key>DOWNLOAD_PAGE_URL</key>
		<string>https://developer.android.com/studio</string>

		<key>RE_PATTERN</key>
		<string>(?P&lt;url&gt;https://edgedl\.me\.gvt1\.com/android/studio/install/[0-9.]+/android-studio-[A-Za-z0-9-]+-mac_arm\.dmg)</string>

		<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
		<false/>
	</dict>

	<key>MinimumVersion</key>
	<string>0.4.0</string>

	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_PAGE_URL%</string>
				<key>re_pattern</key>
				<string>%RE_PATTERN%</string>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>

		<dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
