<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the current Harmony SASE (Perimeter81) macOS .pkg and imports it into Munki with correct version and installs metadata.</string>
  <key>Identifier</key>
  <string>com.github.swifteaminc.recipes.munki.Perimeter81</string>

  <key>Input</key>
  <dict>
    <key>NAME</key><string>Perimeter81</string>
    <key>MUNKI_REPO_SUBDIR</key><string>apps/%NAME%</string>
    <key>pkginfo</key>
    <dict>
      <key>catalogs</key>
      <array>
        <string>VPN</string>
        <string>Security</string>
        <string>Networking</string>
      </array>
      <key>category</key><string>Applications</string>
      <key>description</key>
      <string>Harmony SASE (formerly Perimeter 81) client.</string>
      <key>developer</key><string>Check Point Software Technologies Ltd.</string>
      <key>display_name</key><string>Harmony SASE (Perimeter 81)</string>
      <key>name</key><string>%NAME%</string>
      <key>unattended_install</key><true/>
      <key>unattended_uninstall</key><true/>
      <key>uninstallable</key><true/>
    </dict>
  </dict>

  <key>MinimumVersion</key><string>1.1.0</string>
  <key>ParentRecipe</key><string>com.github.swifteaminc.recipes.download.Perimeter81</string>

  <key>Process</key>
  <array>
    <!-- If your existing pkg parent already unpacks to installer_payload, keep those steps.
         Otherwise, just import the vendor pkg and stamp version from %version%. -->

    <!-- Put %version% into pkginfo so Munki names/compares correctly -->
    <dict>
      <key>Processor</key><string>MunkiPkginfoMerger</string>
      <key>Arguments</key>
      <dict>
        <key>additional_pkginfo</key>
        <dict>
          <key>version</key><string>%version%</string>
        </dict>
      </dict>
    </dict>

    <!-- Import the downloaded vendor .pkg -->
    <dict>
      <key>Processor</key><string>MunkiImporter</string>
      <key>Arguments</key>
      <dict>
        <key>pkg_path</key><string>%pathname%</string>
        <key>repo_subdirectory</key><string>%MUNKI_REPO_SUBDIR%</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>
