<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.Python-virtualenv</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Python</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Python</string>
		<key>NAME</key>
		<string>Python-virtualenv</string>
		<key>PYTHON_PKG_NAME</key>
		<string>virtualenv</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>blocking-applications</key>
			<array>
				<string>virtualenv</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>virtualenv is a tool to create isolated Python environments.</string>
			<key>developer</key>
			<string>Open Planning Project</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.swifteaminc.recipes.munki.Python-package</string>
</dict>
</plist>
