<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest update for Adobe Reader and imports into Munki. This is not a complete
installer for Adobe Reader as is provided by AdobeReader.munki, but recent versions (11.0.11 and 11.0.12)
have not been made available as integrated installers. These updates are also multilingual, and provide
updates for languages that aren't available in full installers.

See AdobeReaderUpdates.download for MAJOR_VERSION and OS_VERSION input variables.

This recipe does not currently support "patch" updaters for Reader DC.

Based on AdobeReaderUpdates recipes by Matthias Choules,
https://github.com/autopkg/recipes/pull/61.
        </string>
        <key>Identifier</key>
        <string>com.github.swifteaminc.recipes.munki.AdobeReaderUpdates</string>
        <key>Input</key>
        <dict>
            <key>BASENAME</key>
            <string>AdobeReader</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/AdobeReader</string>
            <key>NAME</key>
            <string>AdobeReaderUpdate</string>
            <key>pkginfo</key>
            <dict>
                <key>blocking_applications</key>
                <array>
                    <string>Adobe Reader.app</string>
                    <string>Adobe Acrobat Pro.app</string>
                </array>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>Adobe® Reader® is the global standard for reliably viewing, printing, and commenting on PDF documents. It's the only PDF file viewer that can open and interact with all types of PDF content, including forms and multimedia.</string>
                <key>display_name</key>
                <string>Adobe Reader Update</string>
                <key>minimum_os_version</key>
                <string>%OS_VERSION%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
                <key>update_for</key>
                <array>
                    <string>%BASENAME%</string>
                </array>
            </dict>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.swifteaminc.recipes.download.AdobeReaderUpdates</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>DeprecationWarning</string>
                <key>Arguments</key>
                <dict>
                    <key>warning_message</key>
                    <string>This recipe will soon be removed. Please remove it from your list of recipes.</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>installs</key>
                        <array>
                            <dict>
                                <key>CFBundleIdentifier</key>
                                <string>com.adobe.Reader</string>
                                <key>CFBundleName</key>
                                <string>Adobe Reader</string>
                                <key>CFBundleShortVersionString</key>
                                <string>%version%</string>
                                <key>CFBundleVersion</key>
                                <string>%version%</string>
                                <key>path</key>
                                <string>/Applications/Adobe Reader.app</string>
                                <key>type</key>
                                <string>application</string>
                                <key>version_comparison_key</key>
                                <string>CFBundleShortVersionString</string>
                            </dict>
                        </array>
                    </dict>
                </dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
