<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Conductor for macOS by discovering the current CDN DMG URL from conductor.build.</string>

	<key>Identifier</key>
	<string>com.github.swifteaminc.recipes.download.conductor</string>

	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Conductor</string>

		<key>ARCH</key>
		<string>aarch64</string>

		<key>HOMEPAGE_URL</key>
		<string>https://www.conductor.build/</string>

		<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
		<false/>
	</dict>

	<key>MinimumVersion</key>
	<string>0.4.0</string>

	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.swifteaminc.recipes.SharedProcessors/ConductorDownloadURLProvider</string>
			<key>Arguments</key>
			<dict>
				<key>homepage_url</key>
				<string>%HOMEPAGE_URL%</string>
				<key>arch</key>
				<string>%ARCH%</string>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%download_url%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>

		<dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
