<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of ChatGPT Atlas and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.swifteaminc.recipes.munki.ChatGPTAtlas</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/chatgptatlas</string>
        <key>NAME</key>
        <string>ChatGPTAtlas</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>AI Tools</string>
            </array>
            <key>display_name</key>
            <string>ChatGPT Atlas</string>
            <key>category</key>
            <string>AI</string>
            <key>developer</key>
            <string>OpenAI</string>
            <key>description</key>
            <string>ChatGPT Atlas — advanced AI workspace companion for macOS.</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.0.1</string>
    <key>ParentRecipe</key>
    <string>com.github.swifteaminc.recipes.download.ChatGPTAtlas</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
