<!-- <?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Slack.</string>
	<key>Identifier</key>
	<string>com.github.swifteaminc.recipes.download.slack</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Slack</string>
		<key>DOWNLOAD_URL</key>
		<string>https://slack.com/ssb/download-osx</string>
		<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
		<false/>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Slack.app</string>
				<key>requirement</key>
				<string>identifier "com.tinyspeck.slackmacgap" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = BQR82RBBHL</string>
			</dict>
		</dict>
	</array>
</dict>
</plist> -->

<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the latest Slack macOS PKG (arm64 only).</string>

  <key>Identifier</key>
  <string>com.github.swifteaminc.recipes.download.slack-pkg-arm64</string>

  <key>MinimumVersion</key>
  <string>0.4.0</string>

  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Slack</string>

    <!-- Slack's official deployment doc that includes PKG links -->
    <key>DEPLOY_DOC_URL</key>
    <string>https://slack.com/help/articles/360035635174-Deploy-Slack-for-macOS</string>
  </dict>

  <key>Process</key>
  <array>

    <!-- 1) Find the latest arm64 PKG download URL and extract the version -->
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%DEPLOY_DOC_URL%</string>

        <!-- Captures:
             group(1) = version
             group(2) = full pkg URL
        -->
        <key>re_pattern</key>
        <string>(https://downloads\.slack-edge\.com/desktop-releases/mac/arm64/([0-9.]+)/Slack-\2-macOS\.pkg)</string>

        <!-- Put full URL into a variable -->
        <key>result_output_var_name</key>
        <string>download_url</string>

        <!-- Also put version into %version% using capture group 2 -->
        <key>capture_groups</key>
        <dict>
          <key>version</key>
          <integer>2</integer>
        </dict>
      </dict>
    </dict>

    <!-- 2) Download the PKG -->
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%download_url%</string>

        <key>filename</key>
        <string>%NAME%-%version%-macOS-arm64.pkg</string>
      </dict>
    </dict>

    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>

  </array>
</dict>
</plist>
