<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Slack pkg.</string>

	<key>Identifier</key>
	<string>com.github.swifteaminc.recipes.download.slack</string>

	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Slack</string>

		<key>DOWNLOAD_URL</key>
		<string>https://slack.com/api/desktop.latestRelease?redirect=1&amp;variant=pkg&amp;arch=arm64</string>
	</dict>

	<key>MinimumVersion</key>
	<string>0.4.0</string>

	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>filename</key>
				<string>%NAME%.pkg</string>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>PkgVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
