<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Slack.</string>
	<key>Identifier</key>
	<string>com.github.swifteaminc.recipes.download.slack</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Slack</string>
		<key>arch</key>
		<string>arm64</string>
		<key>deploy_doc_url</key>
		<string>https://slack.com/help/articles/360035635174-Deploy-Slack-for-macOS</string>
		<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
		<false/>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>SlackPkgURLProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
				<key>filename</key>
				<string>%NAME%-%version%.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Slack.app</string>
				<key>requirement</key>
				<string>identifier "com.tinyspeck.slackmacgap" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = BQR82RBBHL</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
