<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports Slack into Munki.</string>

	<key>Identifier</key>
	<string>com.github.swifteaminc.recipes.munki.slack</string>

	<key>ParentRecipe</key>
	<string>com.github.swifteaminc.recipes.download.slack</string>

	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Slack</string>

		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>

		<key>pkginfo</key>
		<dict>
			<key>name</key>
			<string>%NAME%</string>

			<key>display_name</key>
			<string>Slack</string>

			<key>description</key>
			<string>Slack is a platform for team communication.</string>

			<key>developer</key>
			<string>Slack Technologies</string>

			<key>category</key>
			<string>Internet &amp; Communication</string>

			<key>catalogs</key>
			<array>
				<string>communication</string>
				<string>collaboration</string>
				<string>messaging</string>
				<string>team-tools</string>
			</array>

			<key>unattended_install</key>
			<true/>

			<key>installs</key>
			<array>
				<dict>
					<key>path</key>
					<string>/Applications/Slack.app</string>

					<key>type</key>
					<string>application</string>

					<key>CFBundleIdentifier</key>
					<string>com.tinyspeck.slackmacgap</string>

					<key>version_comparison_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
			</array>
		</dict>
	</dict>

	<key>MinimumVersion</key>
	<string>0.2.0</string>

	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
