<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest &apos;Slack&apos; and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.swifteaminc.recipes.munki.slack</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Slack</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>communication</string>
				<string>collaboration</string>
				<string>messaging</string>
				<string>team-tools</string>
			</array>
			<key>description</key>
			<string>Slack is a platform for team communication: everything in one place, instantly searchable, available wherever you go.</string>
			<key>display_name</key>
			<string>Slack</string>
			<key>category</key>
			<string>Internet &amp; Communication</string>
			<key>developer</key>
			<string>Slack</string>
			<!-- <key>installcheck_script</key>
			<string>#!/bin/bash
# Munki installcheck: verify the app bundle is present
if [[ -d "/Applications/Slack.app" ]]; then
	exit 1
else
	exit 0
fi
			</string> -->
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.swifteaminc.recipes.download.slack</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
		    <!-- Build installs array from extracted app -->
		<dict>
		<key>Arguments</key>
		<dict>
			<key>faux_root</key>
			<string>%RECIPE_CACHE_DIR%</string>
			<key>installs_item_paths</key>
			<array>
			<string>/Applications/Slack.app</string>
			</array>
		</dict>
		<key>Processor</key>
		<string>MunkiInstallsItemsCreator</string>
		</dict>


		<!-- ✨ NEW: Set pkginfo.version so MunkiImporter names it correctly -->
		<dict>
		<key>Arguments</key>
		<dict>
			<key>additional_pkginfo</key>
			<dict>
			<key>version</key>
			<string>%app_version%</string>
			</dict>
		</dict>
		<key>Processor</key>
		<string>MunkiPkginfoMerger</string>
		</dict>

		<!-- Import the downloaded vendor pkg -->
		<dict>
		<key>Arguments</key>
		<dict>
			<key>pkg_path</key>
			<string>%pathname%</string>
			<key>repo_subdirectory</key>
			<string>%MUNKI_REPO_SUBDIR%</string>
		</dict>
		<key>Processor</key>
		<string>MunkiImporter</string>
		</dict>

		    <!-- Cleanup -->
		<dict>
		<key>Arguments</key>
		<dict>
			<key>path_list</key>
			<array>
			<string>%RECIPE_CACHE_DIR%/unpacked</string>
			<string>%RECIPE_CACHE_DIR%/Applications</string>
			</array>
		</dict>
		<key>Processor</key>
		<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
