<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest verison of mmhmmstudio</string>
		<key>Identifier</key>
		<string>github.com.swifteaminc.recipes.download.mmhmmstudio</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>mmhmmstudio</string>
			<key>DOWNLOAD_URL</key>
			<string>https://updates.mmhmm.app/mac/mmhmmStudio.pkg</string>
			<key>USER_AGENT</key>
			<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/16.4 Safari/605.1.15</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.0.1</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%DOWNLOAD_URL%</string>
					<key>request_headers</key>
					<dict>
						<key>user-agent</key>
						<string>%USER_AGENT%</string>
					</dict>
					<key>filename</key>
					<string>%NAME%.pkg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>