<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current UTunnel macOS installer package, extracts app metadata from the payload, and imports it into Munki.</string>

	<key>Identifier</key>
	<string>com.github.swifteaminc.recipes.munki.UTunnel</string>

	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>UTunnel</string>

		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>

		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>UTunnel.app</string>
			</array>

			<key>catalogs</key>
			<array>
				<string>VPN</string>
				<string>Networking</string>
				<string>Security</string>
			</array>

			<key>category</key>
			<string>Networking</string>

			<key>description</key>
			<string>UTunnel VPN helps users connect to UTunnel-managed VPN infrastructure on macOS.</string>

			<key>developer</key>
			<string>secubytes LLC</string>

			<key>display_name</key>
			<string>UTunnel VPN</string>

			<key>name</key>
			<string>%NAME%</string>

			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>

	<key>MinimumVersion</key>
	<string>1.1</string>

	<key>ParentRecipe</key>
	<string>com.github.swifteaminc.recipes.download.UTunnel</string>

	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/**/Payload</string>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%found_filename%</string>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/UTunnel.app</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%pkgroot%</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/UTunnel.app</string>
				</array>
				<key>version_comparison_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>

		<dict>
			<key>Processor</key>
			<string>PlistReader</string>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%pkgroot%/Applications/UTunnel.app</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleIdentifier</key>
					<string>bundle_id</string>
					<key>CFBundleShortVersionString</key>
					<string>version</string>
					<key>LSMinimumSystemVersion</key>
					<string>minimum_os_version</string>
				</dict>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>installs</key>
					<array>
						<dict>
							<key>CFBundleIdentifier</key>
							<string>%bundle_id%</string>
							<key>CFBundleShortVersionString</key>
							<string>%version%</string>
							<key>path</key>
							<string>/Applications/UTunnel.app</string>
							<key>type</key>
							<string>application</string>
							<key>version_comparison_key</key>
							<string>CFBundleShortVersionString</string>
						</dict>
					</array>
					<key>minimum_os_version</key>
					<string>%minimum_os_version%</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%pkgroot%</string>
					<string>%RECIPE_CACHE_DIR%/unpacked</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
