<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest PyCharm disk image and imports into Munki.</string>
        <key>Identifier</key>
        <string>com.github.swifteaminc.recipes.munki.PyCharm</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/JetBrains/PyCharm</string>
            <key>NAME</key>
            <string>PyCharm</string>
            <key>edition</key>
            <string>community</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>IDE</string>
                    <string>Developer Tools</string>
                </array>
                <key>category</key>
                <string>Productivity</string>
                <key>description</key>
                <string>PyCharm provides smart code completion, code inspections, on-the-fly error highlighting and
                    quick-fixes, along with automated code refactorings and rich navigation capabilities.
                </string>
                <key>developer</key>
                <string>JetBrains</string>
                <key>display_name</key>
                <string>PyCharm Community Edition</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.swifteaminc.recipes.download.PyCharm</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
