<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest PyCharm Apple Silicon disk image.</string>
    <key>Identifier</key>
    <string>com.github.swifteaminc.recipes.download.PyCharm</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PyCharm</string>
        <key>CODESIGNATUREAPPNAME</key>
        <string>PyCharm.app</string>
        <key>CODESIGNATUREREQUIREMENT</key>
        <string>identifier "com.jetbrains.pycharm" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2ZEFAR8TH3"</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PyCharmURLProvider</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
          <key>Processor</key>
          <string>CodeSignatureVerifier</string>
          <key>Arguments</key>
          <dict>
            <key>input_path</key>
            <string>%pathname%/%CODESIGNATUREAPPNAME%</string>
            <key>requirement</key>
            <string>%CODESIGNATUREREQUIREMENT%</string>
          </dict>
        </dict>
    </array>
</dict>
</plist>
