<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest JetBrains Rider Apple Silicon disk image and imports it into Munki.</string>

	<key>Identifier</key>
	<string>com.github.swifteaminc.recipes.munki.Rider</string>

	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/JetBrains/Rider</string>

		<key>NAME</key>
		<string>Rider</string>

		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>IDE</string>
				<string>Developer Tools</string>
			</array>

			<key>category</key>
			<string>Productivity</string>

			<key>description</key>
			<string>JetBrains Rider is a cross-platform IDE for .NET, Unity, and Unreal Engine development.</string>

			<key>developer</key>
			<string>JetBrains</string>

			<key>display_name</key>
			<string>JetBrains Rider</string>

			<key>name</key>
			<string>%NAME%</string>

			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>

	<key>MinimumVersion</key>
	<string>0.2.0</string>

	<key>ParentRecipe</key>
	<string>com.github.swifteaminc.recipes.download.Rider</string>

	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
					<key>installs</key>
					<array>
						<dict>
							<key>CFBundleIdentifier</key>
							<string>com.jetbrains.rider</string>
							<key>CFBundleShortVersionString</key>
							<string>%version%</string>
							<key>path</key>
							<string>/Applications/Rider.app</string>
							<key>type</key>
							<string>application</string>
							<key>version_comparison_key</key>
							<string>CFBundleShortVersionString</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
