<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Microsoft OneDrive installer and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.swifteaminc.recipes.munki.microsoftonedrive</string>
    <key>ParentRecipe</key>
    <string>com.github.swifteaminc.recipes.download.microsoftonedrive</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MicrosoftOnedrive</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Microsoft</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>Cloud Storage</string>
            </array>
            <key>description</key>
            <string>Microsoft Onedrive</string>
            <key>display_name</key>
            <string>Microsoft Onedrive</string>
            <key>developer</key>
            <string>Microsoft</string>
            <key>category</key>
            <string>Productivity</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>minimum_os_version</key>
            <string>10.14.0</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
