<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Tenable Nessus macOS disk image and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.swifteaminc.recipes.munki.Nessus</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>NAME</key>
        <string>Nessus</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>Security</string>
                <string>Infrastructure</string>
            </array>
            <key>category</key>
            <string>Security</string>
            <key>description</key>
            <string>Tenable Nessus is a vulnerability scanner and assessment platform for macOS.</string>
            <key>developer</key>
            <string>Tenable, Inc.</string>
            <key>display_name</key>
            <string>Tenable Nessus</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.swifteaminc.recipes.download.Nessus</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>installcheck_script</key>
                    <string>#!/bin/bash

TARGET_VERSION="%version%"
NESSUS_BIN="/Library/Nessus/run/sbin/nessuscli"

if [[ ! -x "$NESSUS_BIN" ]]; then
    exit 0
fi

CURRENT_VERSION=$(/usr/bin/strings "$NESSUS_BIN" 2&gt;/dev/null | /usr/bin/awk '/^[0-9]+\.[0-9]+\.[0-9]+$/ { print; exit }')

if [[ -z "$CURRENT_VERSION" ]]; then
    exit 0
fi

if [[ "$CURRENT_VERSION" == "$TARGET_VERSION" ]]; then
    exit 1
fi

exit 0</string>
                    <key>installs</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>/Library/Nessus/run/sbin/nessuscli</string>
                            <key>type</key>
                            <string>file</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>/Library/LaunchDaemons/com.tenablesecurity.nessusd.plist</string>
                            <key>type</key>
                            <string>file</string>
                        </dict>
                    </array>
                    <key>minimum_os_version</key>
                    <string>11.0</string>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
