<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads latest Google Chrome disk image (universal) and reads its version.</string>
  <key>Identifier</key>
  <string>com.github.swifteaminc.recipes.download.google-chrome</string>
  <key>Input</key>
  <dict>
    <key>NAME</key><string>GoogleChrome</string>
    <key>DOWNLOAD_URL</key>
    <string>https://dl.google.com/chrome/mac/universal/stable/GGRO/googlechrome.dmg</string>
  </dict>
  <key>MinimumVersion</key><string>0.2.0</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key><string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key><string>%DOWNLOAD_URL%</string>
        <key>filename</key><string>%NAME%.dmg</string>
      </dict>
    </dict>
    <dict><key>Processor</key><string>EndOfCheckPhase</string></dict>

    <!-- Mount the DMG and set %version% from Google Chrome.app -->
    <dict>
      <key>Processor</key><string>AppDmgVersioner</string>
      <key>Arguments</key>
      <dict>
        <key>dmg_path</key><string>%pathname%</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>
