<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the latest Google Chrome disk image and imports into Munki with correct version.</string>
  <key>Identifier</key>
  <string>com.github.swifteaminc.recipes.munki.google-chrome</string>
  <key>Input</key>
  <dict>
    <key>NAME</key><string>GoogleChrome</string>
    <key>MUNKI_REPO_SUBDIR</key><string>apps/%NAME%</string>
    <key>pkginfo</key>
    <dict>
      <key>catalogs</key><array><string>Browsers</string></array>
      <key>category</key><string>Internet &amp; Communication</string>
      <key>description</key><string>Chrome is a fast, simple, and secure web browser, built for the modern web.</string>
      <key>developer</key><string>Google</string>
      <key>display_name</key><string>Google Chrome</string>
      <key>name</key><string>%NAME%</string>
      <key>unattended_install</key><true/>
    </dict>
  </dict>
  <key>MinimumVersion</key><string>0.2.0</string>
  <key>ParentRecipe</key>
  <string>com.github.swifteaminc.recipes.download.google-chrome</string>

  <key>Process</key>
  <array>
    <!-- ensure repo subdir is tidy: apps/GoogleChrome -->
    <dict>
      <key>Processor</key><string>MunkiPkginfoMerger</string>
    </dict>

    <!-- inject version gathered by AppDmgVersioner -->
    <dict>
      <key>Processor</key><string>MunkiPkginfoMerger</string>
      <key>Arguments</key>
      <dict>
        <key>additional_pkginfo</key>
        <dict>
          <key>version</key><string>%version%</string>
        </dict>
      </dict>
    </dict>

    <dict>
      <key>Processor</key><string>MunkiImporter</string>
      <key>Arguments</key>
      <dict>
        <key>pkg_path</key><string>%pathname%</string>
        <key>repo_subdirectory</key><string>%MUNKI_REPO_SUBDIR%</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>
