<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the latest version of Rewind for macOS and reads its version.</string>
    <key>Identifier</key>
    <string>com.github.swifteaminc.recipes.download.RewindAI</string>

    <key>Input</key>
    <dict>
      <key>NAME</key><string>RewindAI</string>
      <key>DOWNLOAD_URL</key><string>https://download.rewind.ai/Rewind.dmg</string>
    </dict>

    <key>MinimumVersion</key><string>1.0</string>

    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key><string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>url</key><string>%DOWNLOAD_URL%</string>
          <key>filename</key><string>%NAME%.dmg</string>
        </dict>
      </dict>

      <dict><key>Processor</key><string>EndOfCheckPhase</string></dict>

      <!-- Pull CFBundleShortVersionString from Rewind.app inside the DMG -->
      <dict>
        <key>Processor</key><string>AppDmgVersioner</string>
        <key>Arguments</key>
        <dict>
          <key>dmg_path</key><string>%pathname%</string>
        </dict>
      </dict>

      <!-- Optional (respects -k DISABLE_CODE_SIGNATURE_VERIFICATION=true):
           If you want, we can add CodeSignatureVerifier here later. -->
    </array>
  </dict>
</plist>
