<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the latest Rewind for macOS from the vendor and reads its version.</string>
  <key>Identifier</key>
  <string>com.github.swifteaminc.recipes.download.RewindAI</string>

  <key>Input</key>
  <dict>
    <key>NAME</key><string>RewindAI</string>
    <key>DOWNLOAD_URL</key><string>https://download.rewind.ai/Rewind.dmg</string>
    <key>UA</key>
    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 13_0) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/16.4 Safari/605.1.15</string>
    <key>REFERER</key><string>https://www.rewind.ai/install</string>
  </dict>

  <key>MinimumVersion</key><string>1.0</string>

  <key>Process</key>
  <array>
    <!-- Download from vendor with headers CDNs often require -->
    <dict>
      <key>Processor</key><string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key><string>%DOWNLOAD_URL%</string>
        <key>filename</key><string>%NAME%.dmg</string>
        <key>request_headers</key>
        <dict>
          <key>User-Agent</key><string>%UA%</string>
          <key>Referer</key><string>%REFERER%</string>
          <key>Accept</key><string>application/octet-stream</string>
        </dict>
        <key>curl_opts</key>
        <array>
          <string>--location</string>
          <string>--fail</string>
          <string>--retry</string><string>3</string>
          <string>--retry-delay</string><string>3</string>
        </array>
      </dict>
    </dict>

    <dict><key>Processor</key><string>EndOfCheckPhase</string></dict>

    <!-- Mount the DMG and set %version% from Rewind.app -->
    <dict>
      <key>Processor</key><string>AppDmgVersioner</string>
      <key>Arguments</key>
      <dict>
        <key>dmg_path</key><string>%pathname%</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>
