<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads Rewind and imports it into Munki with correct version.</string>
  <key>Identifier</key>
  <string>com.github.swifteaminc.recipes.munki.RewindAI</string>

  <key>Input</key>
  <dict>
    <key>NAME</key><string>RewindAI</string>
    <key>MUNKI_REPO_SUBDIR</key><string>apps/%NAME%</string>
    <key>pkginfo</key>
    <dict>
      <key>catalogs</key><array><string>Productivity</string></array>
      <key>category</key><string>Productivity</string>
      <key>developer</key><string>Rewind AI</string>
      <key>display_name</key><string>Rewind AI</string>
      <key>description</key><string>Rewind — record &amp; search your screen and audio.</string>
      <key>name</key><string>%NAME%</string>
      <key>unattended_install</key><true/>
    </dict>
  </dict>

  <key>MinimumVersion</key><string>1.0</string>
  <key>ParentRecipe</key><string>com.github.swifteaminc.recipes.download.RewindAI</string>

  <key>Process</key>
  <array>
    <!-- propagate version from AppDmgVersioner -->
    <dict>
      <key>Processor</key><string>MunkiPkginfoMerger</string>
      <key>Arguments</key>
      <dict>
        <key>additional_pkginfo</key>
        <dict>
          <key>version</key><string>%version%</string>
        </dict>
      </dict>
    </dict>

    <dict>
      <key>Processor</key><string>MunkiImporter</string>
      <key>Arguments</key>
      <dict>
        <key>pkg_path</key><string>%pathname%</string>
        <key>repo_subdirectory</key><string>%MUNKI_REPO_SUBDIR%</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>
