<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Brave Browser and imports into Munki.</string>

	<key>Identifier</key>
	<string>com.github.swifteaminc.recipes.munki.brave</string>

	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Brave</string>

		<key>APP_NAME</key>
		<string>Brave Browser.app</string>

		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>

		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>browsers</string>
				<string>internet</string>
			</array>
			<key>description</key>
			<string>Brave Browser – a privacy-centric web browser with built-in ad and tracker blocking.</string>
			<key>display_name</key>
			<string>Brave Browser</string>
			<key>category</key>
			<string>Internet &amp; Communication</string>
			<key>developer</key>
			<string>Brave Software, Inc.</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>

	<key>MinimumVersion</key>
	<string>0.2.0</string>

	<key>ParentRecipe</key>
	<string>com.github.swifteaminc.recipes.download.brave</string>

	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
					<key>installcheck_script</key>
					<string>#!/bin/bash
set -euo pipefail

app="/Applications/%APP_NAME%"
desired="%version%"

if [ ! -d "$app" ]; then
  /bin/echo "installcheck: app not found at $app"
  exit 1
fi

if [ -z "$desired" ]; then
  /bin/echo "installcheck: desired version is empty"
  exit 1
fi

installed=$(/usr/bin/defaults read "$app/Contents/Info" CFBundleShortVersionString 2>/dev/null || true)
if [ -z "$installed" ]; then
  /bin/echo "installcheck: could not read installed version from $app"
  exit 1
fi

ver_ge() {
  local i=0
  local a=(${1//./ })
  local b=(${2//./ })
  local len=${#a[@]}
  if [ ${#b[@]} -gt $len ]; then
    len=${#b[@]}
  fi
  while [ $i -lt $len ]; do
    local ai=${a[i]:-0}
    local bi=${b[i]:-0}
    if [ $((10#$ai)) -gt $((10#$bi)) ]; then
      return 0
    fi
    if [ $((10#$ai)) -lt $((10#$bi)) ]; then
      return 1
    fi
    i=$((i+1))
  done
  return 0
}

if ver_ge "$installed" "$desired"; then
  /bin/echo "installcheck: installed $installed meets desired $desired"
  exit 0
else
  /bin/echo "installcheck: installed $installed is older than desired $desired"
  exit 1
fi
</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
