<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0\">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Workbrew</string>
    <key>Identifier</key>
    <string>com.github.swifteaminc.recipes.munki.Workbrew</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>NAME</key>
        <string>Workbrew</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>Productivity</string>
                <string>Workflow Tools</string>
            </array>
            <key>display_name</key>
            <string>Workbrew</string>
            <key>category</key>
            <string>Productivity</string>
            <key>developer</key>
            <string>Workbrew</string>
            <key>description</key>
            <string>Workbrew, What if you had perfect memory</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>preinstall_script</key>
            <string>#!/bin/bash\n\nif ! xcode-select -p &gt;/dev/null; then\n    echo \"Xcode Command Line Tools not found. Installing...\"\n    xcode-select --install\n\n    until xcode-select -p &gt;/dev/null; do\n        sleep 5\n    done\n\n    echo \"Xcode Command Line Tools installation completed.\"\nelse\n    echo \"Xcode Command Line Tools already installed.\"\nfi\n</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.0.1</string>
    <key>ParentRecipe</key>
    <string>com.github.swifteaminc.recipes.download.Workbrew</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
