<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0\">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Workbrew</string>
    <key>Identifier</key>
    <string>com.github.swifteaminc.recipes.munki.Workbrew</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>NAME</key>
        <string>Workbrew</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>Productivity</string>
                <string>Workflow Tools</string>
            </array>
            <key>display_name</key>
            <string>Workbrew</string>
            <key>category</key>
            <string>Productivity</string>
            <key>developer</key>
            <string>Workbrew</string>
            <key>description</key>
            <string>Workbrew, What if you had perfect memory</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>preinstall_script</key>
            <string>#!/bin/bash

CURRENT_USER=$(stat -f "%Su" /dev/console)
USER_ID=$(id -u "$CURRENT_USER")

CTL_PATH="/Library/Developer/CommandLineTools"

if [ ! -d "$CTL_PATH" ]; then
    echo "Xcode Command Line Tools not found. Installing..."

    /bin/launchctl asuser $USER_ID sudo xcode-select --install

    # Wait until the directory exists
    until [ -d "$CTL_PATH" ]; do
        sleep 5
    done

    echo "Xcode Command Line Tools installation completed."
else
    echo "Xcode Command Line Tools already installed."
fi
            </string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.0.1</string>
    <key>ParentRecipe</key>
    <string>com.github.swifteaminc.recipes.download.Workbrew</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
