<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of DB Browser for SQLite and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.swifteaminc.recipes.munki.DB Browser for SQLite</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>NAME</key>
        <string>DBBrowserforSQLite</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>Databases</string>
                <string>SQL Tools</string>
                <string>Productivity</string>
                <string>Developer Tools</string>
            </array>
            <key>description</key>
            <string>DB Browser for SQLite is a high quality, visual, open source tool to create, design, and edit database files compatible with SQLite..</string>
            <key>developer</key>
            <string>sqlitebrowser</string>
            <key>display_name</key>
            <string>DB Browser for SQLite</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>ParentRecipe</key>
    <string>com.github.swifteaminc.recipes.download.DB Browser for SQLite</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%filename%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
