<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and installs the latest version of Google Chrome Remote Desktop.

NOTE: This recipe was copied from the deprecated cgerke-recipes repository in April 2021.</string>
	<key>Identifier</key>
	<string>com.github.swifteaminc.recipes.install.ChromeRemoteDesktop</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.swifteaminc.recipes.pkg.ChromeRemoteDesktop</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>
