<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN"
   "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the specified Cursor IDE universal macOS DMG directly.</string>
  <key>Identifier</key>
  <string>com.github.swifteaminc.recipes.download.cursoride</string>
  <key>MinimumVersion</key>
  <string>1.0.0</string>

  <key>Input</key>
  <dict>
    <!-- Point this at the exact DMG URL -->
    <key>DOWNLOAD_URL</key>
    <string>https://downloads.cursor.com/production/d2bf8ec12017b1049f304ad3a5c8867b117ed836/darwin/universal/Cursor-darwin-universal.dmg</string>
    <!-- Optional: set a static version if you care -->
    <key>VERSION</key>
    <string>1.0</string>
  </dict>

  <key>Process</key>
  <array>

    <!-- Simply download the DMG -->
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%DOWNLOAD_URL%</string>
      </dict>
    </dict>

    <!-- Mark end of the check phase -->
    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>

  </array>
</dict>
</plist>
