<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the latest 1Password zip for macOS, unarchives it, locates the app, and verifies its signature.</string>
  <key>Identifier</key>
  <string>com.github.swifteaminc.recipes.download.1Password</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>1Password</string>
  </dict>
  <key>MinimumVersion</key>
  <string>1.1.0</string>

  <key>Process</key>
  <array>
    <!-- Download the .zip -->
    <dict>
      <key>Arguments</key>
      <dict>
        <key>filename</key>
        <string>%NAME%.zip</string>
        <key>url</key>
        <string>https://downloads.1password.com/mac/1Password.zip</string>
      </dict>
      <key>Processor</key>
      <string>URLDownloader</string>
    </dict>

    <dict>
      <key>Processor</key>
      <string>EndOfCheckPhase</string>
    </dict>

    <!-- Unarchive the .zip -->
    <dict>
      <key>Arguments</key>
      <dict>
        <key>archive_path</key>
        <string>%pathname%</string>
        <key>destination_path</key>
        <string>%RECIPE_CACHE_DIR%/unarchived</string>
        <key>purge_destination</key>
        <true/>
      </dict>
      <key>Processor</key>
      <string>Unarchiver</string>
    </dict>

    <!-- Find the 1Password app wherever the zip placed it -->
    <dict>
      <key>Arguments</key>
      <dict>
        <!-- Try common locations and one-level subfolders -->
        <key>pattern</key>
        <string>%RECIPE_CACHE_DIR%/unarchived/*1Password*.app</string>
      </dict>
      <key>Processor</key>
      <string>FileFinder</string>
    </dict>

    <!-- Verify the app bundle's signature -->
    <dict>
      <key>Arguments</key>
      <dict>
        <key>input_path</key>
        <string>%found_path%</string>
        <key>expected_authority_names</key>
        <array>
          <string>Developer ID Application: AgileBits Inc. (2BUA8C4S2C)</string>
          <string>Developer ID Certification Authority</string>
          <string>Apple Root CA</string>
        </array>
      </dict>
      <key>Processor</key>
      <string>CodeSignatureVerifier</string>
    </dict>
  </array>
</dict>
</plist>
