<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Agent-first IDE for AI-native development (Antigravity)</string>

	<key>Identifier</key>
	<string>com.github.swifteaminc.recipes.download.Antigravity</string>

	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Antigravity</string>

		<key>RELEASES_API_URL</key>
		<string>https://antigravity-auto-updater-974169037036.us-central1.run.app/releases</string>

		<key>DOWNLOAD_BASE_URL</key>
		<string>https://edgedl.me.gvt1.com/edgedl/release2/j0qc3/antigravity/stable/</string>

		<key>BUILD</key>
		<string>darwin-arm</string>

		<key>RE_PATTERN</key>
		<string>\{"version":"(?P&lt;version&gt;[0-9]+\.[0-9]+\.[0-9]+)","execution_id":"(?P&lt;execution_id&gt;[0-9]+)"\}</string>
	</dict>

	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%RELEASES_API_URL%</string>
				<key>re_pattern</key>
				<string>%RE_PATTERN%</string>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%DOWNLOAD_BASE_URL%%version%-%execution_id%/%BUILD%/Antigravity.dmg</string>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>

		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<!-- Typical DMG layout: app at root once mounted -->
				<key>input_path</key>
				<string>%pathname%/Antigravity.app</string>

				<key>requirement</key>
				<string>identifier "com.google.antigravity" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EQHXZ8M8AV</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
