<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest verison of Google Drive</string>
		<key>Identifier</key>
		<string>com.github.swifteaminc.recipes.download.GoolgeDrive</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>STGoogleDriveTesting</string>
			<key>DOWNLOAD_URL</key>
			<string>https://dl.google.com/drive-file-stream/GoogleDrive.dmg</string>
			<key>USER_AGENT</key>
			<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10_5) AppleWebKit/601.2.7 (KHTML, like Gecko) Version/9.0.1 Safari/601.2.7</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.0.1</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%DOWNLOAD_URL%</string>
					<key>request_headers</key>
					<dict>
						<key>user-agent</key>
						<string>%USER_AGENT%</string>
					</dict>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
            <dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/GoogleDrive.pkg</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>